-- 单表查询数据
create database medicine;

create table medicine(
	mid varchar(20) not null primary key,
	mname varcghar(20),
	myear smallint,
	mprice smallint,
	mlocation varchar(20),
	mdescription text
)

insert into medicine values
('2020001','黑枸杞','2020','130','玉林','黑枸杞可以起到改善睡眠的功效，具有促进血
液循环的功能，能够帮助加快人体代谢的速度，提高人体抵抗能力。含有的抗氧化物质能够减缓细胞老化的速度。'),
('2020002','金线莲','2020','900','玉林',null),
('2020003','八角茴香','2020','55','玉林','具有温阳散寒，理气止痛的功效。用于中寒
呕吐，脘腹疼痛，腹痛腹胀等。'),
('2020004','八角茴香','2020','72','亳州','八角茴香中含有莽草酸成分，莽草酸具有较
强的抗炎镇痛作用，是抗病毒和抗癌症的药物中间体莽草酸。'),
('2020005','阿胶','2020','3080','安国','阿胶甘平，归肺、肝、肾经。质润而黏，既能补
血止血，又滋阴润肺。用于虚劳咳血、便血、吐血等多种出血性疾病；改善失血后的头
晕、心悸、乏力；改善失眠、虚劳咳喘以及安胎等。'),
('2019001','黑枸杞','2019','150','宁夏','含有的抗氧化物质能够减缓细胞老化的速
度；还可以保护视力。'),
('2019002','金线莲','2019','1200','玉林','金线莲可以直接作用于肝细胞膜，保护干肝
细胞膜，防止有毒物质破坏干细胞，能够增加肝脏的新陈代谢，对受伤的干细胞，促进
受伤的干细胞复活再生。'),
('2019003','八角茴香','2019','46','玉林','具有明显的抗血栓形成作用，可抑制动静脉
血栓及脑血栓的形成。'),
('2018004','阿胶','2018','3300','东阿',null);
select * from medicine;
